[
  {
    "en": {
      "image": "/images/module/avalanche_fundaments.png",
      "duration": "1.5 hours",
      "title": "Avalanche Fundamentals",
      "description": "This course gives you a high level overview of Avalanche Consensus, Subnets and VMs. If you’re new to Avalanche or want to refresh your knowledge and fill in some gaps, this course is right for you.",
      "path": "/es/module/Avalanche-Fundamentals"
    },
    "es": {
      "image": "/images/module/avalanche_fundaments.png",
      "duration": "1.5 horas",
      "title": "Fundamentos de Avalanche",
      "description": "Este curso le brinda una descripción general de alto nivel del consenso, subredes y máquinas virtuales de Avalanche. Si eres nuevo en Avalanche o quieres actualizar tus conocimientos y llenar algunos vacíos, este curso es adecuado para ti.",
      "path": "/en/module/Fundamentos-Avalanche"
    }
  },
  {
    "en": {
      "image": "/images/module/subnet_architecture.png",
      "duration": "1.5 hours",
      "title": "Subnet Architecture",
      "description": "This course dives deeper into the Subnet architecture. It will teach you how to create Subnets with the Avalanche CLI and what their benefits are.",
      "path": "/es/module/Subnet-Architecture"
    },
    "es": {
      "image": "/images/module/subnet_architecture.png",
      "duration": "2.5 horas",
      "title": "Arquitectura de subred",
      "description": "Este curso profundiza en la arquitectura de subred. Le enseñará cómo crear subredes con Avalanche CLI y cuáles son sus beneficios.",
      "path": "/en/module/Arquitectura-Subred"
    }
  },
  {
    "en": {
      "image": "/images/module/teleporter.jpeg",
      "duration": "4 hours",
      "title": "DApps entre subredes con Teleporter (beta)",
      "description": "Cross-chain communication is a crucial building block of multi-chain systems. Utilizing Teleporter and Avalanche Warp Messaging is an incredible easy way to build cross-Subnet dApps, since developers can build on top an extensive and audited development framework.",
      "path": "/es/module/teleporter"
    },
    "es": {
      "image": "/images/module/teleporter.jpeg",
      "duration": "4 horas",
      "title": "Arquitectura de subred",
      "description": "La comunicación entre cadenas es un componente crucial de los sistemas multicadena. Utilizar Teleporter y Avalanche Warp Messaging es una manera increíblemente fácil de crear dApps entre subredes, ya que los desarrolladores pueden construir sobre un marco de desarrollo extenso y auditado.",
      "path": "/en/module/Arquitectura-Subred"
    }
  }
]
